Repository: RMIT-Vietnam-Teaching/cosc2659-cosc2813-ios-assignment-2-2024b-Alakinnn
Catalog: Slay The 11th/Slay The 11th/Utils/Localization/*.lproj/Localizable.strings
Languages: vi

# step0
source: This is your deck, you can select your card from here
vi: Đây là bộ bài của bạn, chọn thẻ để sử dụng

# step1
source: Taps on enemy to use card
vi: Chạm vào kẻ địch để dùng thẻ

# step2
source: This shows their intentions
vi: Đây là ý định của chúng

# step3
source: This is their HP bar
vi: Đây là thanh HP của chúng

# step4
source: The icon above is their debuff
vi: Biểu tượng trên là hiệu ứng xấu của chúng

# step5
source: This is you. The player.
vi: Đây là bạn, người chơi.

# step6
source: This is the shield you've gained.
vi: Đây là khiên bạn đã nhận được.

# step7
source: This is your HP bar, runs out and you're dead.
vi: Đây là thanh HP của bạn, hết là thua.

# step8
source: Click here to end your turn.
vi: Nhấn đây để kết thúc lượt.

# card_attack_name
source: Attack
vi: Tấn Công

# card_attack_description
source: Slash the enemy
vi: Chém kẻ địch

# card_defense_name
source: Defense
vi: Phòng Thủ

# card_defense_description
source: Shield yourself
vi: Tự che chắn

# card_poison_name
source: Poison
vi: Độc

# card_poison_description
source: Poison the enemy
vi: Đầu độc kẻ địch

# card_silence_name
source: Silence
vi: Câm Lặng

# card_silence_description
source: Silence the enemy
vi: Làm câm lặng kẻ địch

# card_draw_name
source: Draw Cards
vi: Rút Bài

# card_draw_description
source: Draw more cards
vi: Rút thêm bài

source: Leaderboard
vi: Bảng Xếp Hạng

source: Achievements
vi: Thành Tựu

source: Analytics
vi: Phân Tích

# no_players
source: No players to display
vi: Không có dữ liệu

source: Gameplay Statistics
vi: Thống Kê

# player_finished_stage
source: %@ finished at stage %d
vi: %@ hoàn thành tại cửa %d

source: Runs Played
vi: Số Lần Chơi

source: Win Rate (%)
vi: Tỉ Lệ Thắng (%)

source: Choose Your Reward
vi: Chọn Phần Thưởng

# heal_description
source: %d%% Max HP
vi: %d%% HP Tối Đa

# attack_buff_description
source: +%d Attack Buff
vi: +%d Sức Tấn Công

# shield_buff_description
source: +%d Shield Buff
vi: +%d Sức Phòng Thủ

# add_cards_description
source: Add %d cards to deck
vi: Thêm %d lá bài vào bộ bài

source: Symbol of Victory
vi: Biểu Tượng Chiến Thắng

# attack_buff_name
source: Attack Buff
vi: Sức Tấn Công

# attack_buff_plus2_description
source: +2 Attack Buff
vi: +2 Sức Tấn Công

# heal_name
source: Heal
vi: Hồi Máu

# heal_35_description
source: Heal 35%
vi: Hồi 35%

# shield_buff_name
source: Shield Buff
vi: Sức Phòng Thủ

# shield_buff_plus3_description
source: +3 Shield Buff
vi: +3 Sức Phòng Thủ

# shield_buff_plus2_description
source: +2 Shield Buff
vi: +2 Sức Phòng Thủ

# double_poison_card_name
source: Double Poison
vi: Độc Kép

# double_poison_card_description
source: Doubles the poison stacks
vi: Nhân đôi số độc

# add_poison_cards_name
source: Add 'XPoison' Cards
vi: Thêm Lá 'XĐộc'

# add_poison_cards_description
source: A card that double poison stacks
vi: Thêm lá nhân đôi số độc

# heal_card_name
source: Heal Card
vi: Lá Hồi Máu

# heal_card_description
source: Heals for 2 HP
vi: Hồi 2 HP

# add_heal_cards_name
source: Add Heal Cards
vi: Thêm Lá Hồi Máu

# add_heal_cards_description
source: Add cards that heal 2 HP
vi: Thêm lá hồi 2 HP

# victory_symbol_name
source: Victory Symbol
vi: Biểu Tượng Chiến Thắng

# victory_symbol_description
source: You won the game!
vi: Bạn đã thắng trò chơi!

# symbolic_award_message
source: Player receives a symbolic award for winning the game.
vi: Người chơi nhận biểu tượng chiến thắng.

# victory_title
source: Victory?
vi: Chiến Thắng?

# victory_subtitle
source: The Spire is to no escape...
vi: Không có lối thoát khỏi Tháp...

source: Main Menu
vi: Menu

source: Game Over
vi: Thua cuộc

# stage_label
source: Stage %d
vi: Cửa %d

source: Save and Quit
vi: Lưu và Thoát

source: Abandon Run
vi: Bỏ Cuộc

source: Cancel
vi: Hủy

source: Unpause
vi: Tiếp Tục

source: Continue Run
vi: Tiếp Tục Chơi

source: Start New Run
vi: Chơi Màn Mới

source: Start Tutorial
vi: Chơi Hướng Dẫn

source: Easy
vi: Dễ

source: Medium
vi: Trung Bình

source: Hard
vi: Khó

source: Music Volume
vi: Âm Lượng Nhạc

source: SFX Volume
vi: Âm Lượng Hiệu Ứng

source: Statistics
vi: Thống Kê

source: Enter Your Name
vi: Nhập Tên Của Bạn

# name_placeholder
source: Name
vi: Tên

# achievement_first_run_name
source: To The Spire
vi: Lên Đỉnh Tháp

# achievement_first_run_description
source: Start a run for the first time.
vi: Chơi ván đầu tiên.

# achievement_gain_attack_buff_name
source: Whetting Blade
vi: Lưỡi Gươm Sắc

# achievement_gain_attack_buff_description
source: Gain an attack buff for the first time.
vi: Tăng cường tấn công lần đầu.

# achievement_gain_shield_buff_name
source: Hard As Rock
vi: Cứng Như Đá

# achievement_gain_shield_buff_description
source: Gain a shield buff for the first time.
vi: Tăng cường phòng thủ lần đầu.

# achievement_reach_stage_7_name
source: Halfway There
vi: Nửa Đường Rồi

# achievement_reach_stage_7_description
source: Reach stage 7 for the first time.
vi: Đạt đến cửa 7 lần đầu.

# achievement_clear_game_first_time_name
source: First Victory?
vi: Chiến Thắng Đầu Tiên?

# achievement_clear_game_first_time_description
source: Clear the game for the first time.
vi: Hoàn thành trò chơi lần đầu.

# achievement_clear_game_easy_name
source: Victory on Easy
vi: Chiến Thắng Mức Dễ

# achievement_clear_game_easy_description
source: Clear the game on Easy difficulty.
vi: Hoàn thành trò chơi mức Dễ.

# achievement_clear_game_medium_name
source: Victory on Medium
vi: Chiến Thắng Mức Trung Bình

# achievement_clear_game_medium_description
source: Clear the game on Medium difficulty.
vi: Hoàn thành trò chơi mức Trung Bình.

# achievement_clear_game_hard_name
source: Victory on Hard
vi: Chiến Thắng Mức Khó

# achievement_clear_game_hard_description
source: Clear the game on Hard difficulty.
vi: Hoàn thành trò chơi mức Khó.

# achievement_unlocked_message
source: Achievement Unlocked: %@
vi: Thành Tựu Đã Được Mở Khóa: %@

source: Confirm
vi: Xác Nhận

# developer_info
source: s3978452 - Duong Tran Minh Hoang
vi: s3978452 - Dương Trần Minh Hoàng

# game_description
source: Slay The 11th is a mobile card game that takes inspiration from one of the most popular games called Slay The Spire. In Slay The 11th, the player will have to fight their way from stage 1 to stage 11 and defeat the mighty boss at the end. During the gameplay, the player will find themselves with a unique set of cards, each with its own usage; some of which are unlocked when they reach a certain stage of the game. Moreover, players will find buffs as a reward of their choice in order to defeat the monsters in the dungeon.
vi: Slay The 11th là một trò chơi thẻ bài trên di động lấy cảm hứng từ một trong những trò chơi phổ biến nhất có tên là Slay The Spire. Trong Slay The 11th, người chơi sẽ phải chiến đấu từ giai đoạn 1 đến giai đoạn 11 và đánh bại con trùm mạnh mẽ ở cuối. Trong quá trình chơi, người chơi sẽ có một bộ thẻ bài độc đáo, mỗi thẻ bài có công dụng riêng; một số trong số đó sẽ được mở khóa khi họ đạt đến một giai đoạn nhất định của trò chơi. Hơn nữa, người chơi sẽ tìm thấy những phần thưởng như một phần thưởng mà họ có thể lựa chọn để đánh bại quái vật trong ngục tối.

# basic_info
source: Here are some basic information on how to play the game, or you can play the tutorial:
vi: Dưới đây là một số thông tin cơ bản về cách chơi trò chơi, hoặc bạn có thể chơi phần hướng dẫn:

# card_variety_title
source: ## Card Variety
vi: ## Đa dạng thẻ bài

# card_variety_1
source: 1. **Attack card**: Select this card to deal damage equal to the value on the card.
vi: 1. **Thẻ tấn công**: Chọn thẻ này để gây sát thương bằng với giá trị trên thẻ.

# card_variety_2
source: 2. **Defend card**: Select this card to shield yourself equal to the value on the card.
vi: 2. **Thẻ phòng thủ**: Chọn thẻ này để bảo vệ bản thân bằng với giá trị trên thẻ.

# card_variety_3
source: 3. **Draw card**: When used, this card will draw additional cards equal to the value on the card.
vi: 3. **Thẻ rút bài**: Khi sử dụng, thẻ này sẽ rút thêm các thẻ bằng với giá trị trên thẻ.

# card_variety_4
source: 4. **Poison card**: A debuff card, use this card to apply poison to the enemy.
vi: 4. **Thẻ độc**: Một thẻ giảm sức mạnh, sử dụng thẻ này để áp dụng độc lên kẻ thù.

# card_variety_5
source: 5. **Silent card**: A debuff card, use this card to apply silence to the enemy.
vi: 5. **Thẻ im lặng**: Một thẻ giảm sức mạnh, sử dụng thẻ này để áp dụng im lặng lên kẻ thù.

# card_variety_6
source: 6. **Heal card**: Obtained from a reward, use this card to heal yourself equal to the value on the card.
vi: 6. **Thẻ hồi máu**: Nhận được từ phần thưởng, sử dụng thẻ này để hồi máu cho bản thân bằng với giá trị trên thẻ.

# card_variety_7
source: 7. **XPoison card**: Obtained from a reward, use this card on the enemy to double the effect of poison they are inflicted with.
vi: 7. **Thẻ XPoison**: Nhận được từ phần thưởng, sử dụng thẻ này lên kẻ thù để nhân đôi hiệu quả của độc mà chúng đang bị.

# debuff_mechanics_title
source: ## Debuff Mechanics
vi: ## Cơ chế giảm sức mạnh

# debuff_mechanics_1
source: 1. **Poison**: When poisoned, the enemies will take damage equal to the current duration they are being inflicted with at the end of the player turn. For example, during the player turn, enemy A has 4 stacks of poison, hence taking 4 damage at the end of the player turn. Poison decrements its duration after each player and enemy turn. Using the same example, after taking 4 damage, if the enemy is still alive, they will take 3 damage at the end of the next player turn unless they die. Poison will decrement until there are no stacks left.
vi: 1. **Độc**: Khi bị nhiễm độc, kẻ thù sẽ nhận sát thương bằng với thời gian còn lại mà chúng đang bị nhiễm độc vào cuối lượt chơi của người chơi. Ví dụ, trong lượt chơi của người chơi, kẻ thù A có 4 lớp độc, do đó nhận 4 sát thương vào cuối lượt chơi của người chơi. Độc giảm dần thời gian sau mỗi lượt chơi của người chơi và kẻ thù. Sử dụng cùng một ví dụ, sau khi nhận 4 sát thương, nếu kẻ thù vẫn còn sống, chúng sẽ nhận 3 sát thương vào cuối lượt chơi tiếp theo của người chơi trừ khi chúng chết. Độc sẽ giảm dần cho đến khi không còn lớp nào.

# debuff_mechanics_2
source: 2. **Silent**: Silence shares the same decrementing effect as Poison. Enemies with a silence effect will not perform any action until the effect ceases.
vi: 2. **Im lặng**: Im lặng chia sẻ cùng hiệu ứng giảm dần với Độc. Kẻ thù với hiệu ứng im lặng sẽ không thực hiện bất kỳ hành động nào cho đến khi hiệu ứng chấm dứt.

# enemy_intentions_title
source: ## Enemy Intentions
vi: ## Ý định của kẻ thù

# enemy_intentions_description
source: Similar to Slay The Spire, enemies in Slay The 11th show their intention during the player turn. The intention varies depending on the situation; they can attack, buff, or cleanse debuffs from themselves or their allies. Enemies who are silent will still show intention with a muted icon.
vi: Tương tự như Slay The Spire, kẻ thù trong Slay The 11th sẽ hiển thị ý định của chúng trong lượt chơi của người chơi. Ý định có thể thay đổi tùy thuộc vào tình huống; chúng có thể tấn công, tăng cường hoặc làm sạch các giảm sức mạnh từ bản thân hoặc đồng minh của chúng. Kẻ thù bị im lặng vẫn sẽ hiển thị ý định với biểu tượng im lặng.

# difficulty_title
source: ## Difficulty
vi: ## Độ khó

# difficulty_description
source: Slay The 11th has 3 difficulties: easy, medium, and hard. The more difficult the game, the tougher the enemies. In hard mode only, debuffs against enemies become less effective. Poison now decrements by 2 instead of 1, like in easy and medium. Silence will be removed after one enemy turn, despite how many stacks they have.
vi: Slay The 11th có 3 mức độ khó: dễ, trung bình và khó. Trò chơi càng khó, kẻ thù càng mạnh mẽ. Chỉ trong chế độ khó, các giảm sức mạnh chống lại kẻ thù trở nên kém hiệu quả hơn. Độc hiện giảm bớt 2 thay vì 1 như trong chế độ dễ và trung bình. Im lặng sẽ bị loại bỏ sau một lượt của kẻ thù bất kể chúng có bao nhiêu lớp.

# how_to_play_title
source: ## How to play
vi: ## Cách chơi

# how_to_play_intro
source: -- Player can play the tutorial to understand the interactions.
vi: -- Người chơi có thể chơi phần hướng dẫn để hiểu các tương tác.

# how_to_play_1
source: 1. Select the card, tap either on the player or the enemy to apply the card effects.
vi: 1. Chọn thẻ, nhấn vào người chơi hoặc kẻ thù để áp dụng hiệu ứng thẻ.

# how_to_play_2
source: 2. Depending on the type of card, there will be an effect. For negative effects like poison or silence, it can't be applied to the player.
vi: 2. Tùy thuộc vào loại thẻ, sẽ có hiệu ứng khác nhau. Đối với các hiệu ứng tiêu cực như độc hoặc im lặng, không thể áp dụng cho người chơi.

# how_to_play_3
source: 3. Try to utilize all the cards in one turn. After the player decides or the player runs out of cards, they can end their turn to draw new cards.
vi: 3. Cố gắng sử dụng tất cả các thẻ trong một lượt. Sau khi người chơi quyết định hoặc hết thẻ, họ có thể kết thúc lượt của mình để rút các thẻ mới.

# how_to_play_4
source: 4. After ending the player turn, enemies will execute whatever intention they were displaying during the last player turn.
vi: 4. Sau khi kết thúc lượt chơi của người chơi, kẻ thù sẽ thực hiện bất kỳ ý định nào mà chúng đã hiển thị trong lượt chơi cuối cùng của người chơi.

# extra_info_title
source: Extra Info
vi: Thông tin thêm

source: Close
vi: Đóng
